docroot/sites/all/modules/commerce_cardsave/xml/3ds.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<ThreeDSecureAuthentication xmlns="https://www.thepaymentgateway.net/">
<ThreeDSecureMessage>
<MerchantAuthentication MerchantID="@merchant_id" Password="@password" />
<ThreeDSecureInputData CrossReference="@md">
<PaRES>@pares</PaRES>
</ThreeDSecureInputData>
<PassOutData></PassOutData>
</ThreeDSecureMessage>
</ThreeDSecureAuthentication>
</soap:Body>
</soap:Envelope>